import type { Metadata } from "next";
import { Geist, Geist_Mono } from "next/font/google";
import "./globals.css";
import Navbar from "./components/Navbar";

const geistSans = Geist({
  variable: "--font-geist-sans",
  subsets: ["latin"],
});

const geistMono = Geist_Mono({
  variable: "--font-geist-mono",
  subsets: ["latin"],
});

export const metadata: Metadata = {
  title: " شركة الطبقات السبعة",
  description: "",
 keywords: [
    "واجهات خارجية",
    "تركيب واجهات جي ار سي",
    "جي ار سي الرياض",
    "تصنيع وتركيب جي ار سي",
    "تنفيذ جي ار سي",
    "تأثيث منزل",
    "تأثيث بيت",
    "تنفيذ كل التصميمات الهندسية",
    "تصميم هندسي",
    "تأثيث غرفة نوم",
    "تأثيث بيوت",
    "تأثيث غرفة طعام",
    "تأثيث مجلس",
    "ترميم",
    "ترميم مباني قديمة",
    "تشطيب داخلي",
    "تشطيب خارجي",
    "تشطيب",
    "بناء",
    "قرميد",
    "تركيب قرميد",
    "توريد قرميد",
    "حجر ترافنتينو",
    "تركيب واجهات حجر",
    "تصميم واجهات حجر",
    "تصميم واجهات جي ار سي",
    "قرميد الرياض",
    "قرميد اليمامة",
    "تركيب واجهات",
    "واجهات حجر",
    "حجر الرياض",
    "جي ار سي",
    "مقاول جي ار سي",
    "تركيب جي ار سي",
    "GRC",
    "grc",
    "اسمنت بورد",
    "مقاول اسمنت بورد",
    "مقاول ملاحق",
    "بناء ملاحق",
    "جبس بورد",
    "ديكورات داخلية",
    "ديكورات جبس",
    "بروفايل",
    "بناء مجالس",
    "مظلات",
    "تركيب مصاعد",
    "دهان",
    "بوية",
    "جي ار جي",
    "مقاولات عامة",
    "مقاولات",
    "اسفلت",
    "حفريات",
    "تشطيب منازل",
    "تشطيب فلل",
    "بناء مفتاح",
    "تركيب رخام",
    "رخام",
    "واجهات حجر",
    "واجهات رخام",
    "واجهات مودرن",
    "اعمال سباكة",
    "اعمال كهرباء",
    "تصليح واجهات",
    "بلاط",
    "مقاول بلاط",
    "بناء فلل",
    "ترميم فيلا",
    "تشطيب فلل",
    "تشطيب فيلا",
    "تصميم واجهات",
    "تصميم اثاث",
    "هدم وترحيل",
    "مقاول بناء فلل",
    "مقاول بناء في الرياض",
    "مقاول جي ار سي في الرياض",
    "ترميم وصيانة جميع المباني",
    "بناء مستودعات",
    "بناء هناغر",
    "بناء هنغر",
    "بناء مستودع",
    "ترميم مستودع",
    "مقاول ترميم",
  ],
  openGraph: {
    title: "Seven Layers | مقاولات وتشطيب وبناء في الرياض",
    description:
      "شركة سبع طبقات: متخصصون في تنفيذ جميع أعمال المقاولات والتشطيب والترميم والديكورات في الرياض. تركيب واجهات GRC، قرميد، رخام، تصميم هندسي، تأثيث منازل، مظلات، بناء فلل ومستودعات.",
    url: "https://www.seven7layers.com/",
    siteName: "Seven Layers",
    locale: "ar_SA",
    type: "website",
  },
};

export default function RootLayout({
  children,
}: Readonly<{
  children: React.ReactNode;
}>) {
  return (
     <html lang="ar" dir="rtl">
      <body
        className={`${geistSans.variable} ${geistMono.variable} antialiased`}
      >
        <Navbar />
        {children}
      </body>
    </html>
  );
}
